# a)Создать список five, состоящий из чисел от одного до пяти.
# b)Создать лямбда функцию, прибавляющую 5 к каждому объекту списка five. Сохранить результат в списке под названием ten.
# c)Расширить список ten списком five и отсортировать
# d)Создать лямбда функцию возвращающую список на основе фильтрации объектов списка ten
# (в теле лямбда функции можно указать фильтрацию по: больше/меньше или равно, чётные, нечётные числа)
# e)Создать функцию для вывода объекта списка по указанному индексу.
# 1.Функция должна работать в бесконечном цикле с командой выхода.
# 2.Индекс должен запрашиваться программой при запуске.
# 3.При неверно указанном индексе использовать исключения с подсказкой ввода.
# 4.У функции должен быть один аргумент по умолчанию -  список ten.
